EDTconf/src/InformationRegisters/НастройкиВерсионированияОбъектов/НастройкиВерсионированияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиВерсионированияОбъектов</name>
  <resources>
    <name>Вариант</name>
    <type>
      <types>EnumRef.ВариантыВерсионированияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTconf/src/Enums/ВариантыВерсионированияОбъектов/ВариантыВерсионированияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыВерсионированияОбъектов</name>
  <enumValues>
    <name>ВерсионироватьПриЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ВерсионироватьПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>НеВерсионировать</name>
  </enumValues>
</mdclass:Enum>

EDTconf/src/InformationRegisters/НастройкиВерсионированияОбъектов/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект Цикл
		Если Строка.Вариант = Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать Тогда
			Строка.Использовать = Ложь;
		Иначе
			Строка.Использовать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
